DataProcessors/УправлениеКадровымРезервом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>УправлениеКадровымРезервом</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатусыГотовностиРезервистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыГотовностиРезервистов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиДействийХарактеристикШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДействийХарактеристикШтатногоРасписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СоответствуютПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОценкиОтветовОпросаПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОценкиОтветовОпросаПоКомпетенциям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольЭксперта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЭксперта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОпросПоКомпетенциям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпросыПоКомпетенциям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Эксперт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПерсонала</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КадровыйРезерв</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВключенияВРезерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИсключенияИзРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКадровогоРезерва</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыВыбораОтветовВОпросахПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыбораОтветовВОпросахПоКомпетенциям</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоШкале</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТочноеЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазначенияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НазначенияКадровогоРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаКадровогоРезерва</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияГруппаДолжностей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/УправлениеКадровымРезервом/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИнформацияОКадровомРезерве", Истина);
	Методы.Вставить("ИнформацияОКадровомРезервеГосслужащих", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнформацияОКадровомРезерве(Должность, ПозицияШтатногоРасписания, ВыводитьКандидатов, ВыводитьРезервПоВидам) Экспорт
	
	ДанныеРезерва = ДанныеКадровогоРезерва();
	ДанныеПозицийРезерва = ДанныеПозицийРезерва();
	
	ПозицииРезерва = ?(ЗначениеЗаполнено(ПозицияШтатногоРасписания),
		КадровыйРезерв.ПозицииКадровогоРезерваСогласноПозицииШтатногоРасписания(ПозицияШтатногоРасписания, Истина, ТекущаяДатаСеанса()),
		КадровыйРезерв.ПозицииКадровогоРезерваСогласноДолжности(Должность, Истина));
		
	ЗаполнитьДанныеПозицийРезерва(ДанныеПозицийРезерва, ПозицииРезерва);
	ВывестиДанныеВТабличныеДокументы(ДанныеРезерва, ДанныеПозицийРезерва, ПозицияШтатногоРасписания, ВыводитьКандидатов);
	
	Возврат ДанныеРезерва;
	
КонецФункции

// Параметры:
//  Отбор - см. КадровыйРезервГосслужащих.ОтборПозицийКадровогоРезерва
//  ВыводитьКандидатов - Булево
//  ВыводитьРезервПоВидам - Булево
// 
// Возвращаемое значение:
//  см. ДанныеКадровогоРезерва
Функция ИнформацияОКадровомРезервеГосслужащих(Отбор, ВыводитьКандидатов, ВыводитьРезервПоВидам) Экспорт
	
	ДанныеРезерва = ДанныеКадровогоРезерва();
	ДанныеПозицийРезерва = ДанныеПозицийРезерва();
	ПозицияШтатногоРасписания = Справочники.ШтатноеРасписание.ПустаяСсылка();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		ПозицииРезерва = МодульКадровыйРезервГосслужащих.ПозицииКадровогоРезерваПоСвойствам(Отбор);
	Иначе
		Возврат ДанныеРезерва;
	КонецЕсли;
	
	ЗаполнитьДанныеПозицийРезерва(ДанныеПозицийРезерва, ПозицииРезерва);
	ВывестиДанныеВТабличныеДокументы(ДанныеРезерва, ДанныеПозицийРезерва, ПозицияШтатногоРасписания, ВыводитьКандидатов,
		Ложь);
	
	Возврат ДанныеРезерва;
	
КонецФункции

Процедура ВывестиДанныеВТабличныеДокументы(ДанныеРезерва, ДанныеПозицийРезерва, ПозицияШтатногоРасписания,
	ВыводитьКандидатов, ВыводитьСотрудников = Истина)
	
	УчастникиРезерва = Новый Массив; // Массив из ОпределяемыйТип.УчастникКадровогоРезерва
	
	ВывестиРезервистов(ДанныеРезерва.Резервисты, ДанныеПозицийРезерва, ПозицияШтатногоРасписания, УчастникиРезерва);
	Если ВыводитьСотрудников Тогда
		ВывестиСотрудников(ДанныеРезерва.Сотрудники, ПозицияШтатногоРасписания, УчастникиРезерва);
	КонецЕсли;
	Если ВыводитьКандидатов Тогда
		ВывестиКандидатов(ДанныеРезерва.Кандидаты, ДанныеПозицийРезерва, ПозицияШтатногоРасписания, УчастникиРезерва);
	КонецЕсли;
	ВывестиПотенциальныхРезервистов(ДанныеРезерва.ПотенциальныеРезервисты, ДанныеПозицийРезерва,
		ПозицияШтатногоРасписания, УчастникиРезерва, ВыводитьКандидатов);
	ВывестиПрошлыхРезервистов(ДанныеРезерва.ПрошлыеРезервисты, ДанныеПозицийРезерва, ПозицияШтатногоРасписания);
	
КонецПроцедуры

// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
//  ДанныеПозицийРезерва - см. ДанныеПозицийРезерва
//  ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание
//  УчастникиРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
Процедура ВывестиРезервистов(ТабличныйДокумент, ДанныеПозицийРезерва, ПозицияШтатногоРасписания, УчастникиРезерва)
	
	Макет = ПолучитьМакет("МакетРезервисты");
	
	Если ДанныеПозицийРезерва.НедоступныеПозицииРезерва.Количество() > 0 Тогда
		Область = Макет.ПолучитьОбласть("НедоступныеПозицииРезерва");
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Если ДанныеПозицийРезерва.ДоступныеПозицииРезерва.Количество() = 0 Тогда
		ВывестиОбластьОтсутствуетПозицияКР(Макет, ТабличныйДокумент, ПозицияШтатногоРасписания);
		Возврат;
	КонецЕсли;
	
	АктуальныйРезерв = АктуальныйРезервПозиций(ДанныеПозицийРезерва.ДоступныеПозицииРезерва);
	Если АктуальныйРезерв.Количество() > 0 Тогда
		Резервисты = АктуальныйРезерв.ВыгрузитьКолонку("УчастникКадровогоРезерва");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УчастникиРезерва, Резервисты);
		ДанныеРезервистов = КадровыйРезерв.ДанныеУчастниковКадровогоРезерва(Резервисты);
		Фотографии = КадровыйРезерв.ФотографииУчастниковКадровогоРезерва(Резервисты);
	Иначе
		ДанныеРезервистов = КадровыйРезерв.НоваяТаблицаДанныхУчастниковКадровогоРезерва();
		Фотографии = Новый Соответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляВыводаРезервистов();
	Запрос.УстановитьПараметр("ПозицияРезерва", ДанныеПозицийРезерва.ДоступныеПозицииРезерва);
	Запрос.УстановитьПараметр("АктуальныйРезерв", АктуальныйРезерв);
	Результат = Запрос.Выполнить();
	
	ВыборкаПриоритетРезерва = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПриоритетРезерва.Следующий() Цикл
		ВыборкаВидРезерва = ВыборкаПриоритетРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидРезерва.Следующий() Цикл
			ВыборкаПозицияРезерва = ВыборкаВидРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПозицияРезерва.Следующий() Цикл
				ВыборкаСтрок = ВыборкаПозицияРезерва.Выбрать();
				
				Область = ОбластьЗаголовок(Макет, ТабличныйДокумент, ВыборкаПозицияРезерва, ВыборкаСтрок);
				Структура = Новый Структура;
				Структура.Вставить("Действие", "ВключитьВРезерв");
				Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаПозицияРезерва.ПозицияКадровогоРезерва);
				Структура.Вставить("Подразделение", ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияШтатногоРасписания, "Подразделение")));
				Если ЗначениеЗаполнено(ВыборкаПозицияРезерва.ВидРезерва) Тогда
					Структура.Вставить("ВидРезерва", ВыборкаПозицияРезерва.ВидРезерва);
				КонецЕсли;
				Область.Параметры.РасшифровкаВключитьВРезерв = Структура;
				ТабличныйДокумент.Вывести(Область);
				
				КоличествоРезервистов = 0;
				Пока ВыборкаСтрок.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ВыборкаСтрок.УчастникКадровогоРезерва) Тогда
						Область = Макет.ПолучитьОбласть("ОтсутствуютРезервисты");
						ТабличныйДокумент.Вывести(Область);
						Продолжить;
					КонецЕсли;
					Область = Макет.ПолучитьОбласть("Резервист|Колонка");
					КоличествоРезервистов = КоличествоРезервистов + 1;
					ЗаполнитьФотографию(Область, Фотографии[ВыборкаСтрок.УчастникКадровогоРезерва],
						ВыборкаСтрок.УчастникКадровогоРезерва);
					ЗаполнитьРейтингРезервиста(Область, ВыборкаСтрок.Рейтинг, ВыборкаСтрок.ПозицияКадровогоРезерва,
						ВыборкаСтрок.УчастникКадровогоРезерва);
					ЗаполнитьРезультатыОценки(Область, ВыборкаСтрок.ПозицияКадровогоРезерва,
						ВыборкаСтрок.УчастникКадровогоРезерва);
						
					НайденныеСтроки = ДанныеРезервистов.НайтиСтроки(Новый Структура("УчастникКадровогоРезерва",
						ВыборкаСтрок.УчастникКадровогоРезерва));
					Если НайденныеСтроки.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						ДанныеСотрудника = НайденнаяСтрока;
						Если НайденнаяСтрока.Организация = ВыборкаСтрок.Организация Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					ЗаполнитьПараметрыОбластиРезервист(Область, ДанныеСотрудника, ВыборкаСтрок);
					ЗаполнитьИндивидуальныйПланРазвития(Область, ВыборкаСтрок, ДанныеСотрудника);
					
					Если КоличествоРезервистов > 2 Тогда
						КоличествоРезервистов = 1;
						ТабличныйДокумент.Вывести(Область);
					Иначе
						ТабличныйДокумент.Присоединить(Область);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ОбластьЗаголовок(Макет, ТабличныйДокумент, ВыборкаПозицияРезерва, ВыборкаСтрок)
	
	Если ВыборкаСтрок.Количество() = 1 Тогда
		Область = Макет.ПолучитьОбласть("ЗаголовокРезервОднаКолонка");
	Иначе
		Область = Макет.ПолучитьОбласть("ЗаголовокРезервДвеКолонки");
	КонецЕсли;
	
	ТекстЗаголовка = ?(ВыборкаПозицияРезерва.Приоритет = 1, НСтр("ru = 'Целевой резерв'"),
		Строка(ВыборкаПозицияРезерва.ПозицияКадровогоРезерва));
	Если ЗначениеЗаполнено(ВыборкаПозицияРезерва.ВидРезерва) Тогда
		ТекстЗаголовка = СтрШаблон(НСтр("ru = '%1 (%2)'"), ТекстЗаголовка, ВыборкаПозицияРезерва.ВидРезерва)
	КонецЕсли;
	Область.Параметры.Заголовок = ТекстЗаголовка;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ОткрытьПозициюКадровогоРезерва");
	Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаПозицияРезерва.ПозицияКадровогоРезерва);
	Область.Параметры.РасшифровкаОткрытьПозициюКадровогоРезерва = Структура;
	
	Возврат Область;
	
КонецФункции

Процедура ВывестиОбластьОтсутствуетПозицияКР(Макет, ТабличныйДокумент, ПозицияШтатногоРасписания)
	
	Область = Макет.ПолучитьОбласть("ОтсутствуетПозицияКР");
	Структура = Новый Структура;
	Структура.Вставить("Действие", "СоздатьПозициюКадровогоРезерва");
	Структура.Вставить("ПозицияШтатногоРасписания", ПозицияШтатногоРасписания);
	Область.Параметры.РасшифровкаСоздатьПозициюКадровогоРезерва = Структура;
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

// Параметры:
//  Область - ТабличныйДокумент
//  ДанныеРезервиста - СтрокаТаблицыЗначений:
//   * УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
//   * ФИОПолные - Строка
//   * Организация - СправочникСсылка.Организации
//   * Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   * Должность - СправочникСсылка.Должности
//   * РабочееМестоПериодРегистрации - Дата
//   * МестоВСтруктуреПредприятия - СправочникСсылка.СтруктураПредприятия
//  ВыборкаСтрок - ВыборкаИзРезультатаЗапроса
Процедура ЗаполнитьПараметрыОбластиРезервист(Область, ДанныеРезервиста, ВыборкаСтрок)
	
	ДобавитьРасшифровкуОткрытьКарточкуСотрудника(Область, ДанныеРезервиста, ВыборкаСтрок);
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ИсключитьИзРезерва");
	Структура.Вставить("Подразделение", ДанныеРезервиста.МестоВСтруктуреПредприятия);
	Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.УчастникКадровогоРезерва);
	Область.Параметры.РасшифровкаИсключитьРезервиста = Структура;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ИзменитьСтатус");
	Структура.Вставить("Подразделение", ДанныеРезервиста.МестоВСтруктуреПредприятия);
	Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаСтрок.ПозицияКадровогоРезерва);
	Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.УчастникКадровогоРезерва);
	Область.Параметры.РасшифровкаИзменитьСтатус = Структура;
	
	Область.Параметры.ФИО = ДанныеРезервиста.ФИОПолные;
	Область.Параметры.Статус = ВыборкаСтрок.Статус;
	Область.Параметры.Организация = ДанныеРезервиста.Организация;
	Область.Параметры.Подразделение = ДанныеРезервиста.Подразделение;
	Область.Параметры.Должность = ДанныеРезервиста.Должность;
	Область.Параметры.ДатаНазначения = Формат(ДанныеРезервиста.РабочееМестоПериодРегистрации, "ДЛФ=D");
	Область.Параметры.ДатаВключения = Формат(ВыборкаСтрок.ДатаВключения, "ДЛФ=D");
	Область.Параметры.ДатаИсключения = Формат(ВыборкаСтрок.ДатаИсключения, "ДЛФ=D");
	Область.Параметры.Наставник = ВыборкаСтрок.Наставник;
	Область.Параметры.Куратор = ВыборкаСтрок.Куратор;

КонецПроцедуры

Функция ТекстЗапросаДляВыводаРезервистов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.Ссылка КАК ПозицияКадровогоРезерва,
		|	ВЫБОР
		|		КОГДА КадровыйРезерв.ПозицияШтатногоРасписания <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет,
		|	КадровыйРезерв.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ЕСТЬNULL(ПодразделенияОрганизаций.Владелец, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
		|ПОМЕСТИТЬ ВТПозициКР
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО КадровыйРезерв.ПозицияШтатногоРасписания = ШтатноеРасписание.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО ПодразделенияОрганизаций.Ссылка = ШтатноеРасписание.Подразделение
		|ГДЕ
		|	КадровыйРезерв.Ссылка В (&ПозицияРезерва)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныйРезерв.ВидРезерва КАК ВидРезерва,
		|	АктуальныйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	АктуальныйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	АктуальныйРезерв.ДатаВключения КАК ДатаВключения,
		|	АктуальныйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	АктуальныйРезерв.Рейтинг КАК Рейтинг,
		|	АктуальныйРезерв.Наставник КАК Наставник,
		|	АктуальныйРезерв.Куратор КАК Куратор
		|ПОМЕСТИТЬ ВТАктуальныйРезерв
		|ИЗ
		|	&АктуальныйРезерв КАК АктуальныйРезерв
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыРезервистовСрезПоследних.ПозицияРезерва КАК ПозицияРезерва,
		|	СтатусыРезервистовСрезПоследних.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	СтатусыРезервистовСрезПоследних.Статус КАК Статус,
		|	СтатусыРезервистовСрезПоследних.Статус.РеквизитДопУпорядочивания КАК СтатусРеквизитДопУпорядочивания
		|ПОМЕСТИТЬ ВТАктуальныеСтатусы
		|ИЗ
		|	РегистрСведений.СтатусыГотовностиРезервистов.СрезПоследних КАК СтатусыРезервистовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ИндивидуальныйПланРазвития.Ссылка) КАК ИндивидуальныйПланРазвития,
		|	МАКСИМУМ(ИндивидуальныйПланРазвития.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ИндивидуальныйПланРазвития.ДатаОкончания) КАК ДатаОкончания,
		|	ИндивидуальныйПланРазвития.Владелец КАК ФизическоеЛицо,
		|	ИндивидуальныйПланРазвития.Основание КАК ПозицияРезерва
		|ПОМЕСТИТЬ ВТИндивидуальныеПланыРазвития
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|ГДЕ
		|	ИндивидуальныйПланРазвития.Основание В (&ПозицияРезерва)
		|	И НЕ ИндивидуальныйПланРазвития.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ИндивидуальныйПланРазвития.Владелец,
		|	ИндивидуальныйПланРазвития.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПозициКР.ПозицияКадровогоРезерва КАК ПозицияКадровогоРезерва,
		|	ВТПозициКР.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ВТПозициКР.Приоритет КАК Приоритет,
		|	ВТАктуальныйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТАктуальныйРезерв.ДатаВключения КАК ДатаВключения,
		|	ВТАктуальныйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	ЕСТЬNULL(ВТАктуальныйРезерв.Рейтинг, 0) КАК Рейтинг,
		|	ВТАктуальныйРезерв.ВидРезерва КАК ВидРезерва,
		|	ВТАктуальныйРезерв.Наставник КАК Наставник,
		|	ВТАктуальныйРезерв.Куратор КАК Куратор,
		|	ВТАктуальныеСтатусы.Статус КАК Статус,
		|	ВТПозициКР.Организация КАК Организация,
		|	ВТИндивидуальныеПланыРазвития.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития,
		|	ВТИндивидуальныеПланыРазвития.ДатаНачала КАК ДатаНачала,
		|	ВТИндивидуальныеПланыРазвития.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВТПозициКР КАК ВТПозициКР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныйРезерв КАК ВТАктуальныйРезерв
		|		ПО ВТПозициКР.ПозицияКадровогоРезерва = ВТАктуальныйРезерв.ПозицияРезерва
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеСтатусы КАК ВТАктуальныеСтатусы
		|		ПО ВТПозициКР.ПозицияКадровогоРезерва = ВТАктуальныеСтатусы.ПозицияРезерва
		|		И ВТАктуальныйРезерв.УчастникКадровогоРезерва = ВТАктуальныеСтатусы.УчастникКадровогоРезерва
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИндивидуальныеПланыРазвития КАК ВТИндивидуальныеПланыРазвития
		|		ПО ВТПозициКР.ПозицияКадровогоРезерва = ВТИндивидуальныеПланыРазвития.ПозицияРезерва
		|		И ВТАктуальныйРезерв.УчастникКадровогоРезерва = ВТИндивидуальныеПланыРазвития.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТАктуальныеСтатусы.СтатусРеквизитДопУпорядочивания УБЫВ,
		|	Приоритет УБЫВ,
		|	Рейтинг УБЫВ
		|ИТОГИ
		|ПО
		|	Приоритет,
		|	ВидРезерва,
		|	ПозицияКадровогоРезерва";
		
	Возврат ТекстЗапроса;
		
КонецФункции

// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
//  ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание
//  УчастникиРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
Процедура ВывестиСотрудников(ТабличныйДокумент, ПозицияШтатногоРасписания, УчастникиРезерва)
	
	Макет = ПолучитьМакет("МакетСотрудники");
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.КадровыеДанные =
		"ДолжностьПоШтатномуРасписанию, ФИОПолные, Организация, Подразделение, Должность, РабочееМестоПериодРегистрации";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,
		"ДолжностьПоШтатномуРасписанию", "=", ПозицияШтатногоРасписания);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,
		"ДатаУвольнения", "=", Дата(1, 1, 1));
	
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	
	КоличествоСотрудников = 0;
	Если СотрудникиОрганизации.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("СотрудникиОтсутствуют");
		Область.Параметры.ПозицияШР = ПозицияШтатногоРасписания;
		ТабличныйДокумент.Вывести(Область);
		Возврат;
	КонецЕсли;
	
	ФизическиеЛица = СотрудникиОрганизации.ВыгрузитьКолонку("ФизическоеЛицо");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УчастникиРезерва, ФизическиеЛица);
	ФотографииФизическихЛиц = КадровыйУчетРасширенный.АдресаФотографийФизическихЛиц(ФизическиеЛица);
	
	Для Каждого СтрокаСотрудник Из СотрудникиОрганизации Цикл
		Область = Макет.ПолучитьОбласть("Сотрудник|Колонка");
		КоличествоСотрудников = КоличествоСотрудников + 1;
		ЗаполнитьФотографию(Область, ФотографииФизическихЛиц[СтрокаСотрудник.ФизическоеЛицо],
			СтрокаСотрудник.ФизическоеЛицо);
		
		Область.Параметры.ФИО = СтрокаСотрудник.ФИОПолные;
		Область.Параметры.Организация = СтрокаСотрудник.Организация;
		Область.Параметры.Подразделение = СтрокаСотрудник.Подразделение;
		Область.Параметры.Должность = СтрокаСотрудник.Должность;
		Область.Параметры.ДатаНазначения = Формат(СтрокаСотрудник.РабочееМестоПериодРегистрации, "ДЛФ=D");
		
		Структура = Новый Структура;
		Структура.Вставить("Действие", "ОткрытьКарточкуСотрудника");
		Структура.Вставить("ФизическоеЛицо", СтрокаСотрудник.ФизическоеЛицо);
		Область.Параметры.РасшифровкаФИО = Структура;
		
		Если КоличествоСотрудников > 2 Тогда
			КоличествоСотрудников = 1;
			ТабличныйДокумент.Вывести(Область);
		Иначе
			ТабличныйДокумент.Присоединить(Область);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
//  ДанныеПозицийРезерва - см. ДанныеПозицийРезерва
//  ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание
//  УчастникиРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
Процедура ВывестиКандидатов(ТабличныйДокумент, ДанныеПозицийРезерва, ПозицияШтатногоРасписания, УчастникиРезерва)
	
	Макет = ПолучитьМакет("МакетКандидаты");
	
	Если ДанныеПозицийРезерва.НедоступныеПозицииРезерва.Количество() > 0 Тогда
		Область = Макет.ПолучитьОбласть("НедоступныеПозицииРезерва");
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;

	Если ДанныеПозицийРезерва.ДоступныеПозицииРезерва.Количество() = 0 Тогда
		ВывестиОбластьОтсутствуетПозицияКР(Макет, ТабличныйДокумент, ПозицияШтатногоРасписания);
		Возврат;
	КонецЕсли;
	
	АктуальныеКандидаты = АктуальныеКандидатыПозиций(ДанныеПозицийРезерва.ДоступныеПозицииРезерва);
	Если АктуальныеКандидаты.Количество() > 0 Тогда
		Резервисты = АктуальныеКандидаты.ВыгрузитьКолонку("УчастникКадровогоРезерва");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УчастникиРезерва, Резервисты);
		ДанныеРезервистов = КадровыйРезерв.ДанныеУчастниковКадровогоРезерва(Резервисты);
		Фотографии = КадровыйРезерв.ФотографииУчастниковКадровогоРезерва(Резервисты);
	Иначе
		ДанныеРезервистов = КадровыйРезерв.НоваяТаблицаДанныхУчастниковКадровогоРезерва();
		Фотографии = Новый Соответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляВыводаКандидатов();
	Запрос.УстановитьПараметр("ПозицияРезерва", ДанныеПозицийРезерва.ДоступныеПозицииРезерва);
	Запрос.УстановитьПараметр("АктуальныеКандидаты", АктуальныеКандидаты);
	Результат = Запрос.Выполнить();
	
	ВыборкаПриоритетРезерва = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПриоритетРезерва.Следующий() Цикл
		ВыборкаВидРезерва = ВыборкаПриоритетРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидРезерва.Следующий() Цикл
			ВыборкаПозицияРезерва = ВыборкаВидРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПозицияРезерва.Следующий() Цикл
				ВыборкаСтрок = ВыборкаПозицияРезерва.Выбрать();
				
				Область = ОбластьЗаголовок(Макет, ТабличныйДокумент, ВыборкаПозицияРезерва, ВыборкаСтрок);
				Структура = Новый Структура;
				Структура.Вставить("Действие", "ДобавитьКандидата");
				Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаПозицияРезерва.ПозицияКадровогоРезерва);
				Структура.Вставить("ВидРезерва", ВыборкаВидРезерва.ВидРезерва);
				Область.Параметры.РасшифровкаДобавитьКандидата = Структура;
				ТабличныйДокумент.Вывести(Область);
				
				КоличествоРезервистов = 0;
				Пока ВыборкаСтрок.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ВыборкаСтрок.УчастникКадровогоРезерва) Тогда
						Область = Макет.ПолучитьОбласть("ОтсутствуютКандидаты");
						ТабличныйДокумент.Вывести(Область);
						Продолжить;
					КонецЕсли;
					Область = Макет.ПолучитьОбласть("Кандидат|Колонка");
					КоличествоРезервистов = КоличествоРезервистов + 1;
					ЗаполнитьФотографию(Область, Фотографии[ВыборкаСтрок.УчастникКадровогоРезерва],
						ВыборкаСтрок.УчастникКадровогоРезерва);
					ЗаполнитьРейтингРезервиста(Область, ВыборкаСтрок.Рейтинг, ВыборкаСтрок.ПозицияКадровогоРезерва,
						ВыборкаСтрок.УчастникКадровогоРезерва);
					ЗаполнитьРезультатыОценки(Область, ВыборкаСтрок.ПозицияКадровогоРезерва,
						ВыборкаСтрок.УчастникКадровогоРезерва);
					НайденныеСтроки = ДанныеРезервистов.НайтиСтроки(Новый Структура("УчастникКадровогоРезерва",
						ВыборкаСтрок.УчастникКадровогоРезерва));
					Если НайденныеСтроки.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					ЗаполнитьПараметрыОбластиКандидат(Область, НайденныеСтроки[0], ВыборкаСтрок);
					Если КоличествоРезервистов > 2 Тогда
						КоличествоРезервистов = 1;
						ТабличныйДокумент.Вывести(Область);
					Иначе
						ТабличныйДокумент.Присоединить(Область);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДляВыводаКандидатов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КадровыйРезерв.Ссылка КАК ПозицияКадровогоРезерва,
		|	ВЫБОР
		|		КОГДА КадровыйРезерв.ПозицияШтатногоРасписания <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет,
		|	КадровыйРезерв.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания
		|ПОМЕСТИТЬ ВТПозициКР
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Ссылка В(&ПозицияРезерва)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныйРезерв.ДатаВключения КАК ДатаВыдвижения,
		|	АктуальныйРезерв.ВидРезерва КАК ВидРезерва,
		|	АктуальныйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	АктуальныйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	АктуальныйРезерв.Рейтинг КАК Рейтинг,
		|	АктуальныйРезерв.Наставник КАК Наставник,
		|	АктуальныйРезерв.Куратор КАК Куратор
		|ПОМЕСТИТЬ ВТАктуальныйРезерв
		|ИЗ
		|	&АктуальныеКандидаты КАК АктуальныйРезерв
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПозициКР.ПозицияКадровогоРезерва КАК ПозицияКадровогоРезерва,
		|	ВТПозициКР.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ВТПозициКР.Приоритет КАК Приоритет,
		|	ВТАктуальныйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ЕСТЬNULL(ВТАктуальныйРезерв.Рейтинг, 0) КАК Рейтинг,
		|	ВТАктуальныйРезерв.ВидРезерва КАК ВидРезерва,
		|	ВТАктуальныйРезерв.Наставник КАК Наставник,
		|	ВТАктуальныйРезерв.Куратор КАК Куратор,
		|	ЕСТЬNULL(ВТАктуальныйРезерв.ДатаВыдвижения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдвижения
		|ИЗ
		|	ВТПозициКР КАК ВТПозициКР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныйРезерв КАК ВТАктуальныйРезерв
		|		ПО ВТПозициКР.ПозицияКадровогоРезерва = ВТАктуальныйРезерв.ПозицияРезерва
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ,
		|	Рейтинг УБЫВ,
		|	ДатаВыдвижения
		|ИТОГИ ПО
		|	Приоритет,
		|	ВидРезерва,
		|	ПозицияКадровогоРезерва";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаполнитьПараметрыОбластиКандидат(Область, ДанныеРезервиста, ВыборкаСтрок)
	
	ДобавитьРасшифровкуОткрытьКарточкуСотрудника(Область, ДанныеРезервиста, ВыборкаСтрок);
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ИсключитьКандидата");
	Если ЗначениеЗаполнено(ВыборкаСтрок.ВидРезерва) Тогда
		Структура.Вставить("ВидРезерва", ВыборкаСтрок.ВидРезерва);
	КонецЕсли;
	Структура.Вставить("Подразделение", ДанныеРезервиста.МестоВСтруктуреПредприятия);
	Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаСтрок.ПозицияКадровогоРезерва);
	Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.УчастникКадровогоРезерва);
	Область.Параметры.РасшифровкаИсключитьКандидата = Структура;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ВключитьКандидата");
	Структура.Вставить("Подразделение", ДанныеРезервиста.МестоВСтруктуреПредприятия);
	Если ЗначениеЗаполнено(ВыборкаСтрок.ВидРезерва) Тогда
		Структура.Вставить("ВидРезерва", ВыборкаСтрок.ВидРезерва);
	КонецЕсли;
	Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаСтрок.ПозицияКадровогоРезерва);
	Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.УчастникКадровогоРезерва);
	Область.Параметры.РасшифровкаВключитьКандидата = Структура;
	
	Область.Параметры.ФИО = ДанныеРезервиста.ФИОПолные;
	Область.Параметры.Организация = ДанныеРезервиста.Организация;
	Область.Параметры.Подразделение = ДанныеРезервиста.Подразделение;
	Область.Параметры.Должность = ДанныеРезервиста.Должность;
	Область.Параметры.ДатаНазначения = Формат(ДанныеРезервиста.РабочееМестоПериодРегистрации, "ДЛФ=D");
	Область.Параметры.ДатаВыдвижения = Формат(ВыборкаСтрок.ДатаВыдвижения, "ДЛФ=D");
	Область.Параметры.Наставник = ВыборкаСтрок.Наставник;
	Область.Параметры.Куратор = ВыборкаСтрок.Куратор;
	
КонецПроцедуры

Процедура ДобавитьРасшифровкуОткрытьКарточкуСотрудника(Область, ДанныеРезервиста, ВыборкаСтрок)
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ОткрытьКарточкуСотрудника");
	Если ДанныеРезервиста.ДополнительныеДанные.Свойство("Кандидат") Тогда
		Структура.Вставить("ФизическоеЛицо", ДанныеРезервиста.ДополнительныеДанные.Кандидат);
	Иначе
		Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.УчастникКадровогоРезерва);
	КонецЕсли;
	Область.Параметры.РасшифровкаФИО = Структура;
	
КонецПроцедуры

Процедура ВывестиПотенциальныхРезервистов(ТабличныйДокумент, ДанныеПозицийРезерва, ПозицияШтатногоРасписания,
	УчастникиРезерва, ВыводитьКандидатов)

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЭкспертнуюОценкуПерсонала") Тогда
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("МакетПотенциальныеРезервисты");
	
	Если ДанныеПозицийРезерва.НедоступныеПозицииРезерва.Количество() > 0 Тогда
		Область = Макет.ПолучитьОбласть("НедоступныеПозицииРезерва");
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Если ДанныеПозицийРезерва.ДоступныеПозицииРезерва.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("ОтсутствуетПозицияКР");
		Структура = Новый Структура;
		Структура.Вставить("Действие", "СоздатьПозициюКадровогоРезерва");
		Структура.Вставить("ПозицияШтатногоРасписания", ПозицияШтатногоРасписания);
		Область.Параметры.РасшифровкаСоздатьПозициюКадровогоРезерва = Структура;
		ТабличныйДокумент.Вывести(Область);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляВыводаПотенциальныхРезервистов();
	Запрос.УстановитьПараметр("ПозицииРезерва", ДанныеПозицийРезерва.ДоступныеПозицииРезерва);
	Запрос.УстановитьПараметр("УчастникиРезерва", УчастникиРезерва);
	Результат = Запрос.Выполнить();
	
	ФизическиеЛица = Результат.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ФизическиеЛица;
	ПараметрыПолучения.ОкончаниеПериода = ТекущаяДатаСеанса();
	ПараметрыПолучения.КадровыеДанные =
		"ФИОПолные, Организация, Подразделение, Должность, РабочееМестоПериодРегистрации, МестоВСтруктуреПредприятия";
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	ФотографииФизическихЛиц = КадровыйУчетРасширенный.АдресаФотографийФизическихЛиц(ФизическиеЛица);
	
	ВыборкаПриоритетРезерва = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПриоритетРезерва.Следующий() Цикл
		ВыборкаПозицияРезерва = ВыборкаПриоритетРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПозицияРезерва.Следующий() Цикл
			ВыборкаСтрок = ВыборкаПозицияРезерва.Выбрать();
			Область = Макет.ПолучитьОбласть("ЗаголовокРезерв");
			ТекстЗаголовка = ?(ВыборкаПозицияРезерва.Приоритет = 1, НСтр("ru = 'Целевой резерв'"),
				Строка(ВыборкаПозицияРезерва.ПозицияРезерва));
			Область.Параметры.Заголовок = ТекстЗаголовка;
			
			Структура = Новый Структура;
			Структура.Вставить("Действие", "ОткрытьПозициюКадровогоРезерва");
			Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаПозицияРезерва.ПозицияРезерва);
			Область.Параметры.РасшифровкаОткрытьПозициюКадровогоРезерва = Структура;
			
			ТабличныйДокумент.Вывести(Область);
			
			КоличествоРезервистов = 0;
			Пока ВыборкаСтрок.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(ВыборкаСтрок.ФизическоеЛицо) Тогда
					Область = Макет.ПолучитьОбласть("ОтсутствуютРезервисты");
					ТабличныйДокумент.Вывести(Область);
					Продолжить;
				КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("Резервист|Колонка");
				КоличествоРезервистов = КоличествоРезервистов + 1;
				ЗаполнитьФотографию(Область, ФотографииФизическихЛиц[ВыборкаСтрок.ФизическоеЛицо],
					ВыборкаСтрок.ФизическоеЛицо);
				НайденныеСтроки = СотрудникиОрганизации.НайтиСтроки(Новый Структура("ФизическоеЛицо",
					ВыборкаСтрок.ФизическоеЛицо));
				Если НайденныеСтроки.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Структура = Новый Структура;
				Структура.Вставить("Действие", "ОткрытьКарточкуСотрудника");
				Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.ФизическоеЛицо);
				Область.Параметры.РасшифровкаФИО = Структура;
				
				ДанныеСотрудника = НайденныеСтроки[0];
				Область.Параметры.ФИО = ДанныеСотрудника.ФИОПолные;
				Область.Параметры.Организация = ДанныеСотрудника.Организация;
				Область.Параметры.Подразделение = ДанныеСотрудника.Подразделение;
				Область.Параметры.Должность = ДанныеСотрудника.Должность;
				Область.Параметры.ДатаНазначения = Формат(ДанныеСотрудника.РабочееМестоПериодРегистрации, "ДЛФ=D");
				Область.Параметры.РезультатыОценки = СтрШаблон(НСтр("ru = '%1 - %2'"), ВыборкаСтрок.ОпросПоКомпетенциям,
					ВыборкаСтрок.Оценка);
				Структура = Новый Структура;
				Структура.Вставить("Действие", "ОткрытьРезультатыЭкспертнойОценки");
				Структура.Вставить("ОпросПоКомпетенциям", ВыборкаСтрок.ОпросПоКомпетенциям);
				Структура.Вставить("ФизическоеЛицо", ВыборкаСтрок.ФизическоеЛицо);
				Область.Параметры.РасшифровкаОткрытьРезультатыЭкспертнойОценки = Структура;
				
				Структура = Новый Структура;
				Структура.Вставить("Действие", "ВключитьВРезерв");
				Структура.Вставить("Подразделение", ДанныеСотрудника.МестоВСтруктуреПредприятия);
				Структура.Вставить("ФизическоеЛицо", ДанныеСотрудника.ФизическоеЛицо);
				Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаПозицияРезерва.ПозицияРезерва);
				Область.Параметры.РасшифровкаВключитьВРезерв = Структура;
				
				Если ВыводитьКандидатов Тогда
					Область.Параметры.ВключитьВКандидаты = НСтр("ru = 'Включить в кандидаты'");
					Структура = Новый Структура;
					Структура.Вставить("Действие", "ВключитьВКандидаты");
					Структура.Вставить("Подразделение", ДанныеСотрудника.МестоВСтруктуреПредприятия);
					Структура.Вставить("ФизическоеЛицо", ДанныеСотрудника.ФизическоеЛицо);
					Структура.Вставить("ПозицияКадровогоРезерва", ВыборкаПозицияРезерва.ПозицияРезерва);
					Область.Параметры.РасшифровкаВключитьВКандидаты = Структура;
				КонецЕсли;
				
				Если КоличествоРезервистов > 2 Тогда
					КоличествоРезервистов = 1;
					ТабличныйДокумент.Вывести(Область);
				Иначе
					ТабличныйДокумент.Присоединить(Область);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДляВыводаПотенциальныхРезервистов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КадровыйРезерв.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА КадровыйРезерв.ПозицияШтатногоРасписания <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет,
		|	КадровыйРезерв.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	КадровыйРезерв.ПрофильДолжности КАК ПрофильДолжности
		|ПОМЕСТИТЬ ВТКадровыйРезерв
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Ссылка В(&ПозицииРезерва)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКадровыйРезерв.Ссылка КАК ПозицияРезерва,
		|	ВЫБОР
		|		КОГДА ВТКадровыйРезерв.ПозицияШтатногоРасписания = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|			ТОГДА ВТКадровыйРезерв.ПрофильДолжности
		|		ИНАЧЕ НастройкиДействийХарактеристикШтатногоРасписания.ПрофильДолжности
		|	КОНЕЦ КАК ПрофильДолжность,
		|	ВТКадровыйРезерв.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ ВТПрофилиПозиций
		|ИЗ
		|	ВТКадровыйРезерв КАК ВТКадровыйРезерв
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиДействийХарактеристикШтатногоРасписания КАК НастройкиДействийХарактеристикШтатногоРасписания
		|		ПО ВТКадровыйРезерв.ПозицияШтатногоРасписания = НастройкиДействийХарактеристикШтатногоРасписания.ПозицияШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала) КАК ОпросПоКомпетенциямДатаНачала,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности КАК ОпросПоКомпетенциямПрофильДолжности
		|ПОМЕСТИТЬ ВТДатыОценки
		|ИЗ
		|	РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности В
		|			(ВЫБРАТЬ
		|				ВТПрофилиПозиций.ПрофильДолжность КАК ПрофильДолжность
		|			ИЗ
		|				ВТПрофилиПозиций КАК ВТПрофилиПозиций)
		|	И НЕ ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо В (&УчастникиРезерва)
		|	И ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности <> ЗНАЧЕНИЕ(Справочник.ПрофилиДолжностей.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности,
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДатыОценки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям КАК ОпросПоКомпетенциям,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|				ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|			ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|		КОНЕЦ) КАК Оценка
		|ПОМЕСТИТЬ ВТРезультатыОценки
		|ИЗ
		|	ВТДатыОценки КАК ВТДатыОценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|		ПО ВТДатыОценки.ОпросПоКомпетенциямДатаНачала = ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала
		|			И ВТДатыОценки.ФизическоеЛицо = ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо
		|			И ВТДатыОценки.ОпросПоКомпетенциямПрофильДолжности = ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям,
		|	ВТДатыОценки.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПрофилиПозиций.Приоритет КАК Приоритет,
		|	ВТПрофилиПозиций.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТПрофилиПозиций.ПрофильДолжность КАК ПрофильДолжность,
		|	ВТРезультатыОценки.ОпросПоКомпетенциям КАК ОпросПоКомпетенциям,
		|	ВТРезультатыОценки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЕСТЬNULL(ВТРезультатыОценки.Оценка, 0) КАК Оценка
		|ИЗ
		|	ВТПрофилиПозиций КАК ВТПрофилиПозиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультатыОценки КАК ВТРезультатыОценки
		|		ПО ВТПрофилиПозиций.ПрофильДолжность = ВТРезультатыОценки.ОпросПоКомпетенциям.ПрофильДолжности
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ,
		|	Оценка УБЫВ
		|ИТОГИ ПО
		|	Приоритет,
		|	ПозицияРезерва";
		
	Возврат ТекстЗапроса;
		
КонецФункции

Процедура ВывестиПрошлыхРезервистов(ТабличныйДокумент, ДанныеПозицийРезерва, ПозицияШтатногоРасписания)
	
	Макет = ПолучитьМакет("МакетПрошлыеРезервисты");
	
	Если ДанныеПозицийРезерва.НедоступныеПозицииРезерва.Количество() > 0 Тогда
		Область = Макет.ПолучитьОбласть("НедоступныеПозицииРезерва");
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Если ДанныеПозицийРезерва.ДоступныеПозицииРезерва.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("ОтсутствуетПозицияКР");
		Структура = Новый Структура;
		Структура.Вставить("Действие", "СоздатьПозициюКадровогоРезерва");
		Структура.Вставить("ПозицияШтатногоРасписания", ПозицияШтатногоРасписания);
		Область.Параметры.РасшифровкаСоздатьПозициюКадровогоРезерва = Структура;
		ТабличныйДокумент.Вывести(Область);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
		|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	КадровыйРезерв.Наставник КАК Наставник,
		|	КадровыйРезерв.Куратор КАК Куратор,
		|	ИсторияКадровогоРезерва.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
		|		ПО КадровыйРезерв.ПозицияРезерва = ИсторияКадровогоРезерва.ПозицияРезерва
		|			И КадровыйРезерв.ВидРезерва = ИсторияКадровогоРезерва.ВидРезерва
		|			И КадровыйРезерв.УчастникКадровогоРезерва = ИсторияКадровогоРезерва.УчастникКадровогоРезерва
		|			И (НАЧАЛОПЕРИОДА(КадровыйРезерв.ДатаИсключения, ДЕНЬ) = НАЧАЛОПЕРИОДА(ИсторияКадровогоРезерва.Период, ДЕНЬ))
		|ГДЕ
		|	КадровыйРезерв.ПозицияРезерва В(&ПозицияРезерва)
		|	И КадровыйРезерв.ДатаИсключения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И КадровыйРезерв.ДатаИсключения < &ТекущаяДата
		|	И ВЫБОР
		|			КОГДА ИсторияКадровогоРезерва.Регистратор ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ИсторияКадровогоРезерва.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка)
		|		КОНЕЦ
		|	И ТИПЗНАЧЕНИЯ(ИсторияКадровогоРезерва.Регистратор) <> ТИП(Документ.ВключениеВКадровыйРезерв)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаИсключения УБЫВ";
	Запрос.УстановитьПараметр("ПозицияРезерва", ДанныеПозицийРезерва.ДоступныеПозицииРезерва);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Область = Макет.ПолучитьОбласть("РезервистыОтсутствуют");
		ТабличныйДокумент.Вывести(Область);
		Возврат;
	КонецЕсли;
	
	ПрошлыеРезервисты = Результат.Выгрузить();
	
	ФизическиеЛица = ПрошлыеРезервисты.ВыгрузитьКолонку("УчастникКадровогоРезерва");
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ФизическиеЛица;
	ПараметрыПолучения.ОкончаниеПериода = ТекущаяДатаСеанса();
	ПараметрыПолучения.КадровыеДанные = "ФИОПолные, Организация, Подразделение, Должность, РабочееМестоПериодРегистрации";
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	Фотографии = КадровыйУчетРасширенный.АдресаФотографийФизическихЛиц(ФизическиеЛица);
	
	КоличествоСотрудников = 0;
	Для Каждого СтрокаСотрудник Из ПрошлыеРезервисты Цикл
		Область = Макет.ПолучитьОбласть("Резервист|Колонка");
		КоличествоСотрудников = КоличествоСотрудников + 1;
		ЗаполнитьФотографию(Область, Фотографии[СтрокаСотрудник.УчастникКадровогоРезерва],
			СтрокаСотрудник.УчастникКадровогоРезерва);
		НайденныеСтроки = СотрудникиОрганизации.НайтиСтроки(Новый Структура("ФизическоеЛицо",
			СтрокаСотрудник.УчастникКадровогоРезерва));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Действие", "ОткрытьКарточкуСотрудника");
		Структура.Вставить("ФизическоеЛицо", СтрокаСотрудник.УчастникКадровогоРезерва);
		Область.Параметры.РасшифровкаФИО = Структура;
		
		ДанныеСотрудника = НайденныеСтроки[0];
		
		Область.Параметры.ФИО = ДанныеСотрудника.ФИОПолные;
		Область.Параметры.Организация = ДанныеСотрудника.Организация;
		Область.Параметры.Подразделение = ДанныеСотрудника.Подразделение;
		Область.Параметры.Должность = ДанныеСотрудника.Должность;
		Область.Параметры.ДатаНазначения = Формат(ДанныеСотрудника.РабочееМестоПериодРегистрации, "ДЛФ=D");
		Область.Параметры.ДатаВключения = Формат(СтрокаСотрудник.ДатаВключения, "ДЛФ=D");
		Область.Параметры.ДатаИсключения = Формат(СтрокаСотрудник.ДатаИсключения, "ДЛФ=D");
		Область.Параметры.Наставник = СтрокаСотрудник.Наставник;
		Область.Параметры.Куратор = СтрокаСотрудник.Куратор;
		Если ТипЗнч(СтрокаСотрудник.Регистратор) = Тип("ДокументСсылка.Увольнение")
			Или ТипЗнч(СтрокаСотрудник.Регистратор) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
			Область.Параметры.Причина = СтрШаблон(НСтр("ru = 'Увольнение от %1'"), Формат(СтрокаСотрудник.ДатаИсключения,
				"ДЛФ=D"));
		ИначеЕсли ТипЗнч(СтрокаСотрудник.Регистратор) = Тип("ДокументСсылка.КадровыйПеревод")
			Или ТипЗнч(СтрокаСотрудник.Регистратор) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
			Область.Параметры.Причина = СтрШаблон(НСтр("ru = 'Кадровый перевод от %1'"),
				Формат(СтрокаСотрудник.ДатаИсключения, "ДЛФ=D"));
		ИначеЕсли ТипЗнч(СтрокаСотрудник.Регистратор) = Тип("ДокументСсылка.ИсключениеИзКадровогоРезерва") Тогда
			Область.Параметры.Причина = СтрШаблон(НСтр("ru = 'Исключение из резерва от %1'"),
				Формат(СтрокаСотрудник.ДатаИсключения, "ДЛФ=D"));
		Иначе
			Область.Параметры.Причина = НСтр("ru = 'Истек срок включения в резерв'");
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Действие", "ПричинаИсключения");
		Структура.Вставить("ДокументыСсылка", СтрокаСотрудник.Регистратор);
		Область.Параметры.РасшифровкаПричинаИсключения = Структура;
		
		Если КоличествоСотрудников > 2 Тогда
			КоличествоСотрудников = 1;
			ТабличныйДокумент.Вывести(Область);
		Иначе
			ТабличныйДокумент.Присоединить(Область);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ПозицииКадровогоРезерва - Массив из СправочникСсылка.КадровыйРезерв
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция АктуальныйРезервПозиций(ПозицииКадровогоРезерва)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
		|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	КадровыйРезерв.Рейтинг КАК Рейтинг,
		|	КадровыйРезерв.Наставник КАК Наставник,
		|	КадровыйРезерв.Куратор КАК Куратор
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	(КадровыйРезерв.ДатаИсключения > &ДатаИсключения
		|			ИЛИ КадровыйРезерв.ДатаИсключения = ДАТАВРЕМЯ(1, 1, 1))
		|	И КадровыйРезерв.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
		|	И КадровыйРезерв.ПозицияРезерва В(&ПозицияРезерва)";
	Запрос.УстановитьПараметр("ПозицияРезерва", ПозицииКадровогоРезерва);
	Запрос.УстановитьПараметр("ДатаИсключения", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция АктуальныеКандидатыПозиций(ПозицииКадровогоРезерва)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
		|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	КадровыйРезерв.Рейтинг КАК Рейтинг,
		|	КадровыйРезерв.Наставник КАК Наставник,
		|	КадровыйРезерв.Куратор КАК Куратор
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается)
		|	И КадровыйРезерв.ПозицияРезерва В(&ПозицияРезерва)
		|	И КадровыйРезерв.ДатаВключения <= &ДатаВключения
		|	И КадровыйРезерв.ДатаИсключения = ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("ПозицияРезерва", ПозицииКадровогоРезерва);
	Запрос.УстановитьПараметр("ДатаВключения", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьФотографию(Макет, АдресФотографии, УчастникКадровогоРезерва)
	
	Если ПустаяСтрока(АдресФотографии) Тогда
		Пол = ПолУчастникаКадровогоРезерва(УчастникКадровогоРезерва);
		Если Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			Макет.Рисунки.Фотография.Картинка = БиблиотекаКартинок.СилуэтМужчина;
		ИначеЕсли Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Макет.Рисунки.Фотография.Картинка = БиблиотекаКартинок.СилуэтЖенщина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Фотография = ПолучитьИзВременногоХранилища(АдресФотографии);
	Макет.Рисунки.Фотография.Картинка = ?(ТипЗнч(Фотография) = Тип("Картинка"), Фотография, Новый Картинка(Фотография));
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ОткрытьКарточкуСотрудника");
	Структура.Вставить("ФизическоеЛицо", УчастникКадровогоРезерва);
	Макет.Параметры.РасшифровкаФИО = Структура;
	
КонецПроцедуры

Функция ПолУчастникаКадровогоРезерва(УчастникКадровогоРезерва)
	
	Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчастникКадровогоРезерва, "Пол");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		Возврат МодульПодборПерсонала.ПолКандидата(УчастникКадровогоРезерва);
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьРейтингРезервиста(Макет, Рейтинг, ПозицииРезерва, ФизическоеЛицо)
	
	Счетчик = 1;
	Пока Счетчик <= Рейтинг Цикл
		Макет.Рисунки["Звезда" + Счетчик].Картинка = БиблиотекаКартинок.ЗвездаАктивная;
		Счетчик = Счетчик +1;
	КонецЦикла;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "УстановитьРейтингОднаЗвезда");
	Структура.Вставить("ПозицияКадровогоРезерва", ПозицииРезерва);
	Структура.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	Макет.Параметры.РасшифрокаРейтингОднаЗвезда = Структура;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "УстановитьРейтингДвеЗвезды");
	Структура.Вставить("ПозицияКадровогоРезерва", ПозицииРезерва);
	Структура.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	Макет.Параметры.РасшифрокаРейтингДвеЗвезды = Структура;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "УстановитьРейтингТриЗвезды");
	Структура.Вставить("ПозицияКадровогоРезерва", ПозицииРезерва);
	Структура.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	Макет.Параметры.РасшифрокаРейтингТриЗвезды = Структура;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "УстановитьРейтингЧетыреЗвезды");
	Структура.Вставить("ПозицияКадровогоРезерва", ПозицииРезерва);
	Структура.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	Макет.Параметры.РасшифрокаРейтингЧетыреЗвезды = Структура;
	
	Структура = Новый Структура;
	Структура.Вставить("Действие", "УстановитьРейтингПятьЗвезд");
	Структура.Вставить("ПозицияКадровогоРезерва", ПозицииРезерва);
	Структура.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	Макет.Параметры.РасшифрокаРейтингПятьЗвезд = Структура;
	
КонецПроцедуры

Функция РезультатыЭкспертнойОценки(ПрофильОценки, ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОпросы
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|ГДЕ
		|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОпросыПоКомпетенциямОцениваемые.Ссылка.ПрофильДолжности = &ПрофильДолжности
		|	И ОпросыПоКомпетенциямОцениваемые.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка.ДатаНачала УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям КАК ОпросПоКомпетенциям,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|				ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|			ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|		КОНЕЦ) КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо В(&ФизическоеЛицо)
		|	И ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям В
		|			(ВЫБРАТЬ
		|				ВТОпросы.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТОпросы КАК ВТОпросы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("ПрофильДолжности", ПрофильОценки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьРезультатыОценки(Макет, ПозицияКадровогоРезерва, ФизическоеЛицо)
	
	ПрофильОценки = ПрофильДолжностиПозицииРезерва(ПозицияКадровогоРезерва);
	Если Не ЗначениеЗаполнено(ПрофильОценки) Тогда
		Макет.Параметры.РезультатыОценки = НСтр("ru = '<нет оценок>'");
		Возврат;
	КонецЕсли;
	
	РезультатыОценки = РезультатыЭкспертнойОценки(ПрофильОценки, ФизическоеЛицо);
	Если РезультатыОценки.Количество() = 0 Тогда
		Макет.Параметры.РезультатыОценки = НСтр("ru = '<нет оценок>'");
		Возврат;
	КонецЕсли;
	
	ДанныеОценки = РезультатыОценки[0];
	Макет.Параметры.РезультатыОценки = СтрШаблон(НСтр("ru = '%1 - %2'"), ДанныеОценки.ОпросПоКомпетенциям,
		Формат(ДанныеОценки.Оценка, "ЧДЦ=2;"));
	Структура = Новый Структура;
	Структура.Вставить("Действие", "ОткрытьРезультатыЭкспертнойОценки");
	Структура.Вставить("ОпросПоКомпетенциям", ДанныеОценки.ОпросПоКомпетенциям);
	Структура.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	Макет.Параметры.РасшифровкаОткрытьРезультатыЭкспертнойОценки = Структура;
	
КонецПроцедуры

Процедура ЗаполнитьИндивидуальныйПланРазвития(Макет, Выборка, ДанныеСотрудника)
	
	Структура = Новый Структура;
	Если ЗначениеЗаполнено(Выборка.ИндивидуальныйПланРазвития) Тогда
		Макет.Параметры.ИПР = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
			Формат(Выборка.ДатаНачала, "ДЛФ=D;"),
			Формат(Выборка.ДатаОкончания, "ДЛФ=D;"));
		Структура.Вставить("Действие", "ОткрытьИПР");
		Структура.Вставить("ИндивидуальныйПланРазвития", Выборка.ИндивидуальныйПланРазвития);
	Иначе
		Макет.Параметры.ИПР = НСтр("ru = 'Создать'");
		Структура.Вставить("Действие", "СоздатьИПР");
		Структура.Вставить("ПозицияКадровогоРезерва", Выборка.ПозицияКадровогоРезерва);
		Структура.Вставить("УчастникКадровогоРезерва", Выборка.УчастникКадровогоРезерва);
		Структура.Вставить("Наставник", Выборка.Наставник);
		Структура.Вставить("Куратор", Выборка.Куратор);
		Структура.Вставить("Подразделение", ДанныеСотрудника.МестоВСтруктуреПредприятия);
	КонецЕсли;
	Макет.Параметры.РасшифровкаОткрытьИПР = Структура;
	
КонецПроцедуры

// Параметры:
//  ДанныеПозицийРезерва - см. ДанныеПозицийРезерва
//  ПозицииРезерва - Массив из СправочникСсылка.КадровыйРезерв
Процедура ЗаполнитьДанныеПозицийРезерва(ДанныеПозицийРезерва, ПозицииРезерва)
	
	Если ПозицииРезерва.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Ссылка В(&ПозицииРезерва)";
	Запрос.УстановитьПараметр("ПозицииРезерва", ПозицииРезерва);
	ДоступныеПозицииРезерва = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	НедоступныеПозицииРезерва = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ПозицииРезерва, ДоступныеПозицииРезерва);
	
	ДанныеПозицийРезерва.ПозицииРезерва = ПозицииРезерва;
	ДанныеПозицийРезерва.ДоступныеПозицииРезерва = ДоступныеПозицииРезерва;
	ДанныеПозицийРезерва.НедоступныеПозицииРезерва = НедоступныеПозицииРезерва;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
// * Резервисты - ТабличныйДокумент
// * Сотрудники - ТабличныйДокумент
// * Кандидаты - ТабличныйДокумент 
// * ПотенциальныеРезервисты - ТабличныйДокумент
// * ПрошлыеРезервисты - ТабличныйДокумент
Функция ДанныеКадровогоРезерва()
	
	ДанныеРезерва = Новый Структура;
	ДанныеРезерва.Вставить("Резервисты", Новый ТабличныйДокумент);
	ДанныеРезерва.Вставить("Сотрудники", Новый ТабличныйДокумент);
	ДанныеРезерва.Вставить("Кандидаты", Новый ТабличныйДокумент);
	ДанныеРезерва.Вставить("ПотенциальныеРезервисты", Новый ТабличныйДокумент);
	ДанныеРезерва.Вставить("ПрошлыеРезервисты", Новый ТабличныйДокумент);
	
	Возврат ДанныеРезерва;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * ПозицииРезерва - Массив из СправочникСсылка.КадровыйРезерв
// * ДоступныеПозицииРезерва - Массив из СправочникСсылка.КадровыйРезерв 
// * НедоступныеПозицииРезерва - Массив из СправочникСсылка.КадровыйРезерв
Функция ДанныеПозицийРезерва()
	
	ДанныеПозицийРезерва = Новый Структура;
	ДанныеПозицийРезерва.Вставить("ПозицииРезерва", Новый Массив);
	ДанныеПозицийРезерва.Вставить("ДоступныеПозицииРезерва", Новый Массив);
	ДанныеПозицийРезерва.Вставить("НедоступныеПозицииРезерва", Новый Массив);
	
	Возврат ДанныеПозицийРезерва;
	
КонецФункции

// Параметры:
//  ПозицияКадровогоРезерва - СправочникСсылка.КадровыйРезерв
// 
// Возвращаемое значение:
//  СправочникСсылка.ПрофилиДолжностей
Функция ПрофильДолжностиПозицииРезерва(ПозицияКадровогоРезерва)
	
	ПрофильДолжности = Справочники.ПрофилиДолжностей.ПустаяСсылка();
	ДанныеПозицииРезерва = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПозицияКадровогоРезерва,
		"Назначение,ПрофильДолжности,ПозицияШтатногоРасписания");
	
	Если ДанныеПозицииРезерва.Назначение = Перечисления.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва Тогда
		ПрофильДолжности = ДанныеПозицииРезерва.ПрофильДолжности;
	ИначеЕсли ДанныеПозицииРезерва.Назначение = Перечисления.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания Тогда
		ПрофилиДолжности = ХарактеристикиПерсонала.ПрофильДолжностиПоПозицииШтатногоРасписания(
			ДанныеПозицииРезерва.ПозицияШтатногоРасписания);
		Если ПрофилиДолжности.Количество() > 0 Тогда
			ПрофильДолжности =  ПрофилиДолжности[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПрофильДолжности;
	
КонецФункции

#КонецОбласти

#КонецЕсли
